Repository: pingfangx/TranslatorX-other
Catalog: AndroidGuide/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: In order to do so, you need to create your own interpolator resource in an XML file.
zh_cn: 为此，需要在 XML 文件中创建自己的插值器资源。

source: In order to properly draw your custom view, you need to know what size it is.
zh_cn: 为了正确绘制自定义 view，你需要知道它的大小。

source: In order to run this animation, you must inflate the XML resources in your code to an AnimatorSet object, and then set the target objects for all of the animations before starting the animation set.
zh_cn: 要运行此动画，必须将代码中的 XML 资源加载为一个 AnimatorSet 对象，然后在启动动画集之前为所有动画设置目标对象。

source: In particular you should eliminate allocations in onDraw(), because allocations may lead to a garbage collection that would cause a stutter.
zh_cn: 特别是你应该消除 onDraw() 中的分配，因为分配可能会导致垃圾收集，从而导致不流畅。

source: In particular, note the definition of LinedEditText in the NoteEditor.java file.
zh_cn: 特别要注意 NoteEditor.java 文件中 LinedEditText 的定义。

source: In some complex layouts, the system may waste effort measuring the same UI element more than once.
zh_cn: 在一些复杂的布局中，系统可能会浪费多次测量同一个 UI 元素的工作。

source: In some situations, images need to be animated on screen.
zh_cn: 在某些情况下，图像需要在屏幕上进行动画。

source: In the Component Tree window, select the views you want inside the barrier and drag them into the barrier component.
zh_cn: 在 Component Tree 窗口中，选择要在屏障内显示的视图，并将它们拖到屏障组件中。

source: In the Layout section of the Attributes window, click on a constraint anchor, as shown in figure 6.
zh_cn: 在 Attributes 窗口的 Layout 部分，点击一个约束锚，如图 6。

source: In the PieChart example, onSizeChanged() is where the PieChart view calculates the bounding rectangle of the pie chart and the relative position of the text label and other visual elements.
zh_cn: 在 PieChart 示例中，onSizeChanged() 是 PieChart view 计算饼图的边界矩形的位置，文本标签和其他视觉元素的相对位置。

source: In the Component Tree window, right-click the layout and click Convert layout to ConstraintLayout.
zh_cn: 在 Component Tree 窗口，右击布局然后点击 Convert layout to ConstraintLayout。

source: In the Project window, click the module folder and then select File > New > XML > Layout XML.
zh_cn: 在 Project 窗口，点击 module 文件夹，然后选择 File > New > XML > Layout XML。

source: In the NotePad example, the custom component is used directly from the declarative layout, so take a look at note_editor.xml in the res/layout folder.
zh_cn: 在 NotePad 示例中，自定义组件直接从声明性布局中使用，因此请查看 res/layout 文件夹中的 note_editor.xml。

source: In the beginning, this animation accelerates up to the halfway point then decelerates from the halfway point until the end of the animation.
zh_cn: 在开始时，该动画加速到中间点，然后从中间点减速到动画结束。

source: In the case of extending a Layout, you don't need to override the onDraw() and onMeasure() methods since the layout will have default behavior that will likely work just fine.
zh_cn: 在继承 Layout 的情况下，你不必重写 onDraw() 或 onMeasure() 方法，因为 layout 有自己的默认行为可以很好的工作。

source: In the constructor for the new class, take whatever parameters the superclass expects, and pass them through to the superclass constructor first.
zh_cn: 在新类的构造方法中，首先取出父类需要的参数，通过父类的构造的方法传递给它。

source: In the end, you can very quickly construct arbitrarily complex compound views and re-use them as if they were a single component.
zh_cn: 最后，你可以任意组合和复用复杂的组件，只需把它们当作一个单一的组件。

source: In the example below, we use XML.
zh_cn: 在下面的示例中，我们使用 XML。

source: In the following example, modifying the currently selected pie slice in PieChart causes the entire chart to rotate so that the selection pointer is centered in the selected slice.
zh_cn: 在以下示例中，修改 PieChart 中当前选定的饼图切片会导致整个图表旋转，以使选择指针在所选切片中居中。

source: In the previous MotionLayout example, the app:layoutDescription attribute references a MotionScene.
zh_cn: 在前面的 MotionLayout 示例中，app:layoutDescription 属性引用一个 MotionScene。

source: In the same way a complex web page can slow down load time, your layout hierarchy if too complex can also cause performance problems.
zh_cn: 一个复杂的网页会减缓加载时间，同样你的布局层次结构如果过于复杂也会导致性能问题。

source: In the toolbar or sync notification, click Sync Project with Gradle Files.
zh_cn: 在工具栏或同步通知中，点吉 Sync Project with Gradle Files。

source: In this case, the instructions are the order and duration for each frame of the animation.
zh_cn: 在这种情况下，指令是动画每帧的顺序和持续时间。

source: In this document
zh_cn: 在本文档中

source: In this example, we define one ConstraintSet for each endpoint of our motion.
zh_cn: 在本例中，我们为运动的每个端点定义一个 ConstraintSet。

source: In this implementation, PieChart attempts to make its area big enough to make the pie as big as its label:
zh_cn: 在此实现中，PieChart 尝试使其区域足够大，使得饼与其标签一样大：

source: In this lesson you'll learn to use Hierarchy Viewer and Lint to examine and optimize your layout.
zh_cn: 在本课中，你将学习使用 Hierarchy Viewer 和 Lint 检查和优化布局。

source: Inside the layout to which you want to add the re-usable component, add the <include/> tag.
zh_cn: 在要添加可重用组件的布局中，添加 <include/> 标签。

source: Inspect Your Layout
zh_cn: 检查你的布局

source: Inspection Configuration
zh_cn: 检查配置

source: Inspection of the new layout looks like this:
zh_cn: 新布局的检查如下所示：

source: Instead of adding constraints to every view as you place them in the layout, you can move each view into the positions you desire, and then click Infer Constraints to automatically create constraints.
zh_cn: 在布局中放置约束时，你可以将每个视图移动到所需的位置，然后单击 Infer Constraints 以自动创建约束，而不是将约束添加到每个视图。

source: Instead of belonging to the http://schemas.android.com/apk/res/android namespace, they belong to http://schemas.android.com/apk/res/[your package name].
zh_cn: 它们不属于 http://schemas.android.com/apk/res/android 命名空间，而属于 http://schemas.android.com/apk/res/[your package name]。

source: Instead use "match constraints" (0dp).
zh_cn: 而是使用 "match constraints" (0dp)。

source: Instead, consider displaying a notification.
zh_cn: 相反，请考虑显示 通知。

source: Instead, images should move from one place to another.
zh_cn: 相反，图像应该从一个地方移动到另一个地方。

source: Instead, it is determined by the system through a combination of the parts of the application that the system knows are running, how important these things are to the user, and how much overall memory is available in the system.
zh_cn: 相反，它是由系统通过组合应用程序中系统知道正在运行的部分、这些东西对用户有多重要以及系统中有多少总内存可用来确定的。

source: Instead, it sets their sizes directly according to its own custom layout algorithm.
zh_cn: 相反，它根据自己的自定义布局算法直接设置它们的大小。

source: Instead, pass the AttributeSet to obtainStyledAttributes().
zh_cn: 取而代之的是，将 AttributeSet 传递给 obtainStyledAttributes()。

source: Instead, the method communicates its results by calling setMeasuredDimension().
zh_cn: 相反，该方法通过调用 setMeasuredDimension() 来传达其结果。

source: Instead, use ValueAnimator to make the change.
zh_cn: 而是使用 ValueAnimator 进行更改。

source: Interpolated attributes
zh_cn: 插值属性

source: Interpolator class
zh_cn: 插值器类

source: It also means that any elements of your application that are common across multiple layouts can be extracted, managed separately, then included in each layout.
zh_cn: 这还意味着，应用程序中跨多个布局通用的任何元素都可以被提取、单独管理，然后包含在每个布局中。

source: It also might make sense to use both animation systems for different situations if the use case arises.
zh_cn: 如果用例出现，在不同的情况下同时使用这两个动画系统也是有意义的。

source: It does allow you to move work to another thread to avoid glitching the main thread.
zh_cn: 它允许你将工作转移到另一个线程，以避免主线程出现故障。

source: It does not support nested layout hierarchies or activity transitions.
zh_cn: 它不支持嵌套的布局层次结构或 activity 转换。

source: It encapsulates a specific set of functionality with an easy to use interface, it uses CPU and memory efficiently, and so forth.
zh_cn: 它通过易于使用的接口封装了一组特定的函数，它有效地使用 CPU 和内存，等等。

source: It extends EditText, which is the View we have chosen to customize in this case.
zh_cn: 它继承于我们所选择进行自定义的 EditText。

source: It has a BroadcastReceiver that is currently running (its BroadcastReceiver.onReceive() method is executing).
zh_cn: 它有一个 BroadcastReceiver 当前正在运行(其 BroadcastReceiver.onReceive() 方法正在执行)。

source: It has a Service that is currently executing code in one of its callbacks (Service.onCreate(), Service.onStart(), or Service.onDestroy()).
zh_cn: 它有一个 Service 当前在其回调之一中执行代码(Service.onCreate()，Service.onStart() 或 Service.onDestroy())。

source: It has a Service that is running as a foreground service, through Service.startForeground() (which is asking the system to treat the service as something the user is aware of, or essentially visible to them).
zh_cn: 它有一个 Service 作为前台服务运行，通过 Service.startForeground()(它要求系统将该服务视为用户意识到的或用户基本可见的东西)。

source: It has all of the core functionality that calculates animation values and contains the timing details of each animation, information about whether an animation repeats, listeners that receive update events, and the ability to set custom types to evaluate.
zh_cn: 它具有计算动画值的所有核心功能，并包含每个动画的计时详细信息、有关动画是否重复的信息、接收更新事件的侦听器以及设置要求值的自定义类型的能力。

source: It is static, meaning it does not generate the so-called "synthetic methods" that allow it to access data from the parent class, which in turn means that it really behaves as a separate class rather than something strongly related to NoteEditor.
zh_cn: 它是 static 方法，意味首它不会生成可以访问父类数据的所谓的 "synthetic methods（不知道怎么翻译，改天翻书去）"，相反的意味着它确实表现为一个独立的类而不会强烈依赖 NoteEditor。

source: It is a common misconception that using the basic layout structures leads to the most efficient layouts.
zh_cn: 使用基本布局结构会导致最有效的布局，这是一种常见的误解。

source: It is always good practice to run the lint tool on your layout files to search for possible view hierarchy optimizations.
zh_cn: 在布局文件上运行 lint 工具来搜索可能的视图层次结构优化，这是一个好的实践。

source: It is especially important that layouts that will be inflated multiple times—such as this one—are optimized as the performance benefits will be multiplied.
zh_cn: 尤其重要的是，当性能效益成倍增加时，将多次加载的布局(如本布局)将得到优化。

source: It is hosting a service that the system is using for a particular feature that the user is aware, such as a live wallpaper, input method service, etc.
zh_cn: 它托管了一个服务，系统正在使用该服务来实现用户知道的特定功能，例如实时墙纸、输入方法服务等。

source: It is important that application developers understand how different application components (in particular Activity, Service, and BroadcastReceiver) impact the lifetime of the application's process.
zh_cn: 应用程序开发人员必须了解不同的应用程序组件(特别是 Activity、Service 和 BroadcastReceiver)如何影响应用程序进程的生命周期。

source: It is just one example of how each layout has appropriate uses and you should carefully consider whether using layout weight is necessary.
zh_cn: 这只是每个布局如何有适当使用的一个例子，你应该仔细考虑是否需要使用布局权重。

source: It is replaced by the inflated layout and the ID for the root view of that layout is the one specified by the android:inflatedId attribute of the ViewStub.
zh_cn: 它被加载的布局替换，该布局的根视图的 ID 是由 ViewStub 的 android:inflatedId 属性指定的。

source: It is running an Activity at the top of the screen that the user is interacting with (its onResume() method has been called).
zh_cn: 它运行的是 Activity 在屏幕的顶部，该用户与交互(其 onResume() 方法被调用)。

source: It is running an Activity that is visible to the user on-screen but not in the foreground (its onPause() method has been called).
zh_cn: 它运行的是 Activity 在屏幕上对用户可见，但是不在前台(其 onPause() 方法被调用)。

source: It is the fully qualified name of the custom view class.
zh_cn: 它是自定义 view 类的完全限定名称。

source: It makes a best effort to constrain the views to their current positions while allowing flexibility.
zh_cn: 它尽最大努力将 view 限制在当前位置，同时允许灵活性。

source: It should be used to help users understand what your application is doing.
zh_cn: 它应该用来帮助用户了解你的应用程序正在做什么。

source: It should be visible only when new items are being imported into the app.
zh_cn: 只有当新项目导入到应用程序中时，它才应该可见。

source: It should try to stay within the specifications passed in, although it can choose to exceed them (in this case, the parent can choose what to do, including clipping, scrolling, throwing an exception, or asking the onMeasure() to try again, perhaps with different measurement specifications).
zh_cn: 它应该尽量留在传递的规格中，尽管它也可以选择超过它们(在这种情况下，父类会选择一项操作，包括修剪，滚动，抛出异常，让 onMeasure() 重试，也许使用不同的测量规格)。

source: It uses a mix of text, lines, and shapes.
zh_cn: 它使用文本，线条和形状的混合。

source: It's common to divide the x and y velocity by a factor of 4 to 8.
zh_cn: 将 x 和 y 速度除以 4 到 8 倍是很常见的。

source: It's customary to put these resources into a res/values/attrs.xml file.
zh_cn: 习惯上将这些资源放入 res/values/attrs.xml 文件中。

source: It's easy to forget to expose properties and events, especially when you're the only user of the custom view.
zh_cn: 很容易忘记公开属性和事件，尤其是当你是自定义view的 唯一用户时。

source: It's important to note that the start() method called on the AnimationDrawable cannot be called during the onCreate() method of your Activity, because the AnimationDrawable is not yet fully attached to the window.
zh_cn: 需要注意的是，在 Activity 的 onCreate() 方法中，无法在 AnimationDrawable 上调用 start() 方法，因为 AnimationDrawable 尚未完全附加到窗口。

source: It's similar to RelativeLayout in that all views are laid out according to relationships between sibling views and the parent layout, but it's more flexible than RelativeLayout and easier to use with Android Studio's Layout Editor.
zh_cn: 它类似于 RelativeLayout 因为所有视图都是根据兄弟视图和父布局之间的关系来布局的，但它比 RelativeLayout 更灵活，并且更易于与 Android Studio 的布局编辑器一起使用。

source: It's your responsibility to make sure you get and apply new coordinates often enough to make the scrolling animation look smooth.
zh_cn: 你有责任确保经常获得并应用新坐标，以使滚动动画看起来流畅。

source: Java API Framework
zh_cn: Java API 框架

source: Java is a registered trademark of Oracle and/or its affiliates.
zh_cn: Java 是 Oracle 和/或其附属公司的注册商标。

source: Just as with primitive shapes, paths can be outlined, filled, or both, depending on the setStyle().
zh_cn: 与基本形状一样，路径可以是轮廓，填充或两者，具体取决于 setStyle()。

source: Keep the following changes in mind if your app targets Android 7.0 (API level 24) or higher, or if it's installed on devices running Android 7.0 or higher.
zh_cn: 如果你的应用针对的是 Android 7.0(API 级别 24)或更高版本，或者安装在运行 Android 7.0 或更高版本的设备上，请记住以下更改。

source: Keyframe animations
zh_cn: 关键帧动画

source: Label your input fields using the android:contentDescription attribute
zh_cn: 使用 android:contentDescription 属性标记输入字段

source: Layout
zh_cn: 布局

source: Layout hierarchy for the layout in figure 1, using RelativeLayout.
zh_cn: 图 1 中布局的布局层次结构，使用 RelativeLayout。

source: Layout hierarchy for the layout in figure 1, using nested instances of LinearLayout.
zh_cn: 图 1 中布局的布局层次结构，使用 LinearLayout 的嵌套实例。

source: Layouts are a key part of Android applications that directly affect the user experience.
zh_cn: 布局是 Android 应用程序中直接影响用户体验的关键部分。

source: Lessons
zh_cn: 课程

source: Let's take a detailed look at how the important components of the property animation system would calculate animations like the ones illustrated above.
zh_cn: 让我们详细了解一下属性动画系统的重要组件将如何计算与上述动画类似的动画。

source: Like many other UI frameworks, Android supports an input event model.
zh_cn: 与许多其他 UI 框架一样，Android 支持输入事件模型。

source: Likewise, you need to request a new layout if a property changes that might affect the size or shape of the view.
zh_cn: 同样，如果属性更改可能会影响 view 的大小或形状，则需要请求新布局。

source: Lint automatically runs whenever you compile your program.
zh_cn: Lint 在编译程序时自动运行。

source: Lint has replaced the Layoutopt tool and has much greater functionality.
zh_cn: Lint 已经取代了 Layoutopt 工具，具有更强大的功能。

source: Lint has the ability to automatically fix some issues, provide suggestions for others and jump directly to the offending code for review.
zh_cn: Lint 能够自动修复一些问题，为其他问题提供建议，并直接跳转到有问题的代码进行检查。

source: Load the ViewStub Layout
zh_cn: 加载 ViewStub 布局

source: Loading Views On Demand
zh_cn: 按需加载视图

source: Local Broadcasts can be used as a general purpose pub/sub event bus in your app without any overheads of system wide broadcasts.
zh_cn: 本地广播可以用作应用程序中的通用 pub/sub 事件总线，而无需系统范围广播的任何开销。

source: Make Your Transitions Smooth
zh_cn: 让你的过渡平滑

source: Make sure that action names and other strings are written in a namespace you own, or else you may inadvertently conflict with other apps.
zh_cn: 请确保操作名和其他字符串是在你自己的命名空间中写入的，否则你可能会无意中与其他应用程序发生冲突。

source: Make your view hierarchies as shallow as possible.
zh_cn: 使你的 view 层次结构尽可能浅。

source: Making the View Interactive
zh_cn: 使 view 可交互

source: Manage motion and widget animation with MotionLayout
zh_cn: 使用 MotionLayout 管理运动和小部件动画

source: Manifest-declared receivers
zh_cn: 清单声明接收器

source: Many core Android system components and services, such as ART and HAL, are built from native code that require native libraries written in C and C++.
zh_cn: 许多核心 Android 系统组件和服务，如 ART 和 HAL，都是由需要用 C 和 C++ 编写的原生库的原生代码构建的。

source: Merge root frame - If a FrameLayout is the root of a layout and does not provide background or padding etc, it can be replaced with a merge tag which is slightly more efficient.
zh_cn: 合并根 frame - 如果 FrameLayout 是布局的根，并且不提供背景或内边距等，则可以用稍微更有效的 merge 标签替换它。

source: Methods
zh_cn: 方法

source: Modern touch UIs define interactions in terms of gestures such as tapping, pulling, pushing, flinging, and zooming.
zh_cn: 现代触摸 UI 定义了手势方面的交互，例如点击，拉动，推动，投掷和缩放。

source: Modifying an Existing View Type
zh_cn: 修改一个已存在的 View 类型

source: Moreover, it inherently supports seekable transitions.
zh_cn: 此外，它固有地支持 seekable transitions (可查找转换)。

source: Most calls to onDraw() are the result of a call to invalidate(), so eliminate unnecessary calls to invalidate().
zh_cn: 大多数对 onDraw() 的调用是对 invalidate() 的调用的结果，因此应消除对 invalidate() 的不必要调用。

source: Most of the difference is due to the use of layout_weight in the LinearLayout design, which can slow down the speed of measurement.
zh_cn: 大多数差异是由于在 LinearLayout 设计中使用了 layout_weight，这会降低测量速度。

source: Most views pass the Scroller object's x and y position directly to scrollTo().
zh_cn: 大多数 view 将 Scroller 对象的 x 和 y 位置直接传递给 scrollTo()。

source: Motion in your app should not be simply a gratuitous special effect in your application.
zh_cn: 应用程序中的运动不应只是应用程序中的免费特殊效果。

source: Motions begin and end smoothly instead of starting and stopping abruptly.
zh_cn: 动作开始和结束平滑地而不是突然开始和停止。

source: Must be a child of a <animation-list> element.
zh_cn: 必须是 <animation-list> 元素的子元素。

source: Native C/C++ Libraries
zh_cn: 原生 C/C++ 库

source: Near the top of the Attributes window is the view inspector, which includes controls for several layout attributes, as shown in figure 14 (this is available only for views in a constraint layout).
zh_cn: 在 Attributes 窗口的顶部附近是视图检查器，它包括几个布局属性的控件，如图 14 所示(这仅适用于约束布局中的视图)。

source: Never make an allocation while an animation is running.
zh_cn: 永远不要在动画运行时进行分配。

source: No attributes
zh_cn: 没有属性

source: No attributes.
zh_cn: 没有属性。

source: Note also that the inner class we defined is referenced using the NoteEditor$LinedEditText notation which is a standard way to refer to inner classes in the Java programming language.
zh_cn: 另请注意，我们定义的内部类是使用 NoteEditor$LinedEditText 表示法引用的，这是一种在 Java 编程语言中引用内部类的标准方法。

source: Note that TypedArray objects are a shared resource and must be recycled after use.
zh_cn: 请注意，TypedArray 对象是共享资源，必须在使用后回收。

source: Note that definitions in the MotionScene take precedence over any similar definitions in the MotionLayout.
zh_cn: 请注意，MotionScene 中的定义优先于 MotionLayout 中的任何类似定义。

source: Note that it is possible to add your own parameters as well, and we will touch on this again below.
zh_cn: 注意，你也可以添加自己的参数，我们将在后面再讨论。

source: Note that just like with an Activity, you can use either the declarative (XML-based) approach to creating the contained components, or you can nest them programmatically from your code.
zh_cn: 注意，就像 Activity 一样，你既可以用申明的方式来创建这种容器组件(基于 XML)，也可以在代码中用编程的方式嵌套它们。

source: Note that the constraint turns red to indicate that you can click to delete it, as shown in figure 5.
zh_cn: 注意，约束变为红色表示你可以单击以删除它，如图 5 所示。

source: Note that the latest version might be different than what is shown in the example:
zh_cn: 请注意，最新版本可能与示例中显示的不同：

source: Note that when specifying a custom attribute, you must define endpoint values in both the start and end <ConstraintSet> elements.
zh_cn: 请注意，在指定自定义属性时，必须在 start 和 end <ConstraintSet> 元素中定义端点值。

source: Note that you also might introduce your own attributes and parameters into the XML that can be pulled out and used by your constructor.
zh_cn: 注意，你也可以在 XML 文件中引入一些自己的属性和参数，然后在构造方法中取出来使用。

source: Note the following:
zh_cn: 请注意以下几点：

source: Notice that setShowText calls invalidate() and requestLayout().
zh_cn: 请注意，setShowText 调用 invalidate() 和 requestLayout()。

source: Notice that as you drag the constraint handle, the Layout Editor shows potential connection anchors and blue overlays.
zh_cn: 请注意，拖动约束控制柄时，布局编辑器将显示潜在的连接定位点和蓝色覆盖。

source: Notice that each Interpolator implementation, when defined in XML, begins its name in lowercase.
zh_cn: 注意，每个 Interpolator 实现在用 XML 定义时，都以小写开头。

source: Notice that the LinedEditText class is now a separate class file.
zh_cn: 注意此时的 LinedEditText 类是一个独立的类文件。

source: Notice the name of the XML tag that adds the custom view to the layout.
zh_cn: 请注意将自定义 view 添加到布局的 XML 标记的名称。

source: Now that you have a well-designed view that responds to gestures and transitions between states, ensure that the view runs fast.
zh_cn: 既然你有一个精心设计的 view 来响应手势和状态之间的转换，请确保 view 快速运行。

source: Now the entire size is dictated by the height of the view (which can be defined in any way) as shown in figure 15.
zh_cn: 现在整个尺寸由 view 的高度(其可以以任何方式定义)来决定，如图 15 所示。

source: Now you can create a constraint from another view to the barrier.
zh_cn: 现在可以从另一个视图创建到屏障的约束。

source: Now you're ready to build your layout with ConstraintLayout.
zh_cn: 现在你已经准备好用 ConstraintLayout 来构建布局了。

source: Now, when you include this layout in another layout (using the <include/> tag), the system ignores the <merge> element and places the two buttons directly in the layout, in place of the <include/> tag.
zh_cn: 现在，当你在另一个布局中包含此布局时(使用 <include/> 标签)，系统将忽略 <merge> 元素，并将两个按钮直接放置在布局中，而不是 <include/> 标签。

source: Objects should always act in the same way that real objects do.
zh_cn: 对象应始终以与真实对象相同的方式起作用。

source: On Android 4.4 (API level 19) and higher, you can use the transition framework to create animations when you swap the layout within the current activity or fragment.
zh_cn: 在 Android 4.4(API 级别 19)及更高版本上，当你交换当前 activity 或 fragment 中的布局时，可以使用过渡框架来创建动画。

source: On Android 5.0 (API level 21) and higher, you can also create animations that transition between your activities.
zh_cn: 在 Android 5.0(API 级别 21)及更高版本上，你还可以创建在 activity 之间过渡的动画。

source: Once completed, your new extension class can be used in place of the view upon which it was based.
zh_cn: 一旦完成，你的新继承类就可以用来代替它的基类。

source: Once it returns, the system considers the BroadcastReceiver to be no longer active, and thus, its hosting process no longer needed (unless other application components are active in it).
zh_cn: 一旦返回，系统将认为广播接收器不再处于活动状态，因此不再需要其宿主进程(除非其他应用程序组件在其中处于活动状态)。

source: Once the width and height are calculated, the setMeasuredDimension(int width, int height) method must be called with the calculated measurements.
zh_cn: 一旦计算出了宽度和高度，必须用计算的结果调用 setMeasuredDimension(int width, int height) 方法。

source: Once visible/inflated, the ViewStub element is no longer part of the view hierarchy.
zh_cn: 一旦可见/加载，ViewStub 元素就不再是视图层次结构的一部分。

source: Once you define the custom attributes, you can use them in layout XML files just like built-in attributes.
zh_cn: 定义自定义属性后，可以像布局属性一样在布局 XML 文件中使用它们。

source: Once you have your object creation and measuring code defined, you can implement onDraw().
zh_cn: 一旦定义了对象创建和测量代码，就可以实现 onDraw()。

source: Once you've implemented GestureDetector.OnGestureListener and created an instance of GestureDetector, you can use your GestureDetector to interpret the touch events you receive in onTouchEvent().
zh_cn: 一旦实现了 GestureDetector.OnGestureListener 并创建了 GestureDetector 的实例，就可以使用 GestureDetector 解释你在 onTouchEvent() 中收到的触摸事件。

source: Once your code returns from this method, the system considers the component no longer active.
zh_cn: 一旦代码从此方法返回后，系统将认为该组件不再处于活动状态。

source: One drawback of ViewStub is that it doesn’t currently support the <merge> tag in the layouts to be inflated.
zh_cn: ViewStub 的一个缺点是它当前不支持要加载的布局中的 <merge> 标签。
